{"data":{"allPrismicBlogpost":{"edges":[{"node":{"id":"Prismic__Blogpost__W9zJ3RAAACcAYYBa","data":{"id":1,"title":{"text":"12 tips to help you lose weight on the 12-week plan","html":"<h1>12 tips to help you lose weight on the 12-week plan</h1>"},"image":{"alt":"","copyright":"","url":"https://blog-template.cdn.prismic.io/blog-template/e1f9fcb206fb81f26c09fac8e5fed5b036ac2165_diet.jpg"},"description":{"text":"Get off to the best possible start on the NHS 12-week weight loss plan with these 12 diet and exercise tips. 1. Don't skip breakfast Skipping breakfast won't help you lose weight. You could miss out on essential nutrients and you may end up snacking more throughout the day because you feel hungry. Check out five healthy breakfasts. 2. Eat regular meals Eating at regular times during the day helps burn calories at a faster rate. It also reduces the temptation to snack on foods high in fat and sugar. Find out more about eating heathily. 3. Eat plenty of fruit and veg Fruit and veg are low in calories and fat, and high in fibre – 3 essential ingredients for successful weight loss. They also contain plenty of vitamins and minerals. Read up on getting your 5 A Day. 4. Get more active Being active is key to losing weight and keeping it off. As well as providing numerous health benefits, exercise can help burn off the excess calories you can't cut through diet alone. Find an activity you enjoy and are able to fit into your routine. 5. Drink plenty of water People sometimes confuse thirst with hunger. You can end up consuming extra calories when a glass of water is really what you need. 6. Eat high-fibre foods Foods containing lots of fibre can help keep you to feel full, which is perfect for losing weight. Fibre is only found in food from plants, such as fruit and veg, oats, wholegrain bread, brown rice and pasta, and beans, peas and lentils. 7. Read food labels Knowing how to read food labels can help you choose healthier options. Use the calorie information to work out how a particular food fits into your daily calorie allowance on the weight loss plan. Find out more about reading food labels. 8. Use a smaller plate Using smaller plates can help you eat smaller portions. By using smaller plates and bowls, you may be able to gradually get used to eating smaller portions without going hungry. It takes about 20 minutes for the stomach to tell the brain it's full, so eat slowly and stop eating before you feel full. 9. Don't ban foods Don't ban any foods from your weight loss plan, especially the ones you like. Banning foods will only make you crave them more. There's no reason you can't enjoy the occasional treat as long as you stay within your daily calorie allowance. 10. Don't stock junk food To avoid temptation, try to not stock junk food – such as chocolate, biscuits, crisps and sweet fizzy drinks – at home. Instead, opt for healthy snacks, such as fruit, unsalted rice cakes, oat cakes, unsalted or unsweetened popcorn, and fruit juice. 11. Cut down on alcohol A standard glass of wine can contain as many calories as a piece of chocolate. Over time, drinking too much can easily contribute to weight gain. Find out more about the calories in alcohol. 12. Plan your meals Try to plan your breakfast, lunch, dinner and snacks for the week, making sure you stick to your calorie allowance. You may find it helpful to make a weekly shopping list.","html":"<p><strong>Get off to the best possible start on the NHS 12-week weight loss plan with these 12 diet and exercise tips.</strong></p><h2>1. Don&#39;t skip breakfast</h2><p>Skipping breakfast won&#39;t help you lose weight. You could miss out on essential nutrients and you may end up snacking more throughout the day because you feel hungry. Check out five healthy breakfasts.</p><h2>2. Eat regular meals</h2><p>Eating at regular times during the day helps burn calories at a faster rate. It also reduces the temptation to snack on foods high in fat and sugar. Find out more about eating heathily.</p><h2>3. Eat plenty of fruit and veg</h2><p>Fruit and veg are low in calories and fat, and high in fibre – 3 essential ingredients for successful weight loss. They also contain plenty of vitamins and minerals. Read up on getting your 5 A Day.</p><h2>4. Get more active</h2><p>Being active is key to losing weight and keeping it off. As well as providing numerous health benefits, exercise can help burn off the excess calories you can&#39;t cut through diet alone. Find an activity you enjoy and are able to fit into your routine.</p><h2>5. Drink plenty of water</h2><p>People sometimes confuse thirst with hunger. You can end up consuming extra calories when a glass of water is really what you need.</p><h2>6. Eat high-fibre foods</h2><p>Foods containing lots of fibre can help keep you to feel full, which is perfect for losing weight. Fibre is only found in food from plants, such as fruit and veg, oats, wholegrain bread, brown rice and pasta, and beans, peas and lentils.</p><h2>7. Read food labels</h2><p>Knowing how to read food labels can help you choose healthier options. Use the calorie information to work out how a particular food fits into your daily calorie allowance on the weight loss plan. Find out more about reading food labels.</p><h2>8. Use a smaller plate</h2><p>Using smaller plates can help you eat smaller portions. By using smaller plates and bowls, you may be able to gradually get used to eating smaller portions without going hungry. It takes about 20 minutes for the stomach to tell the brain it&#39;s full, so eat slowly and stop eating before you feel full.</p><h2>9. Don&#39;t ban foods</h2><p>Don&#39;t ban any foods from your weight loss plan, especially the ones you like. Banning foods will only make you crave them more. There&#39;s no reason you can&#39;t enjoy the occasional treat as long as you stay within your daily calorie allowance.</p><h2>10. Don&#39;t stock junk food</h2><p>To avoid temptation, try to not stock junk food – such as chocolate, biscuits, crisps and sweet fizzy drinks – at home. Instead, opt for healthy snacks, such as fruit, unsalted rice cakes, oat cakes, unsalted or unsweetened popcorn, and fruit juice.</p><h2>11. Cut down on alcohol</h2><p>A standard glass of wine can contain as many calories as a piece of chocolate. Over time, drinking too much can easily contribute to weight gain. Find out more about the calories in alcohol.</p><h2>12. Plan your meals</h2><p>Try to plan your breakfast, lunch, dinner and snacks for the week, making sure you stick to your calorie allowance. You may find it helpful to make a weekly shopping list.</p>"}}}}]}},"pageContext":{"productId":1}}