{"data":{"allPrismicBlogpost":{"edges":[{"node":{"id":"Prismic__Blogpost__W9y1XhAAACgAYSV4","data":{"id":0,"title":{"text":"How to Lose Weight Fast: 3 Simple Steps, Based on Science","html":"<h1>How to Lose Weight Fast: 3 Simple Steps, Based on Science</h1>"},"image":{"alt":"","copyright":"","url":"https://blog-template.cdn.prismic.io/blog-template/5a0f0ba4454f9629ef91472b69bcfab30fc729f8_obese-vs-thin-woman-1296x818.jpg"},"description":{"text":"There are many ways to lose a lot of weight fast. However, most of them will make you hungry and unsatisfied. If you don't have iron willpower, then hunger will cause you to give up on these plans quickly. The plan outlined here will: Reduce your appetite significantly. Make you lose weight quickly, without hunger. Improve your metabolic health at the same time. Here is a simple 3-step plan to lose weight fast. 1. Cut Back on Sugars and Starches The most important part is to cut back on sugars and starches (carbs). When you do that, your hunger levels go down and you end up eating much fewer calories. Now instead of burning carbs for energy, your body starts feeding off of stored fat. Another benefit of cutting carbs is that it lowers insulin levels, causing your kidneys to shed excess sodium and water out of your body. This reduces bloat and unnecessary water weight . It is not uncommon to lose up to 10 pounds (sometimes more) in the first week of eating this way, both body fat and water weight. This is a graph from a study comparing low-carb and low-fat diets in overweight or obese women . Share on Pinterest The low-carb group is eating until fullness, while the low-fat group is calorie-restricted and hungry. Cut the carbs and you will start to eat fewer calories automatically and without hunger. Put simply, cutting carbs puts fat loss on autopilot. SUMMARYRemoving sugars and starches (carbs) from your diet will reduce your appetite, lower your insulin levels and make you lose weight without hunger. 2. Eat Protein, Fat and Vegetables Each one of your meals should include a protein source, a fat source and low-carb vegetables. Constructing your meals in this way will automatically bring your carb intake into the recommended range of 20–50 grams per day. Protein Sources Meat: Beef, chicken, pork, lamb, etc. Fish and Seafood: Salmon, trout, shrimp, etc. Eggs: Whole eggs with the yolk are best. The importance of eating plenty of protein cannot be overstated. This has been shown to boost metabolism by 80 to 100 calories per day. High-protein diets can also reduce cravings and obsessive thoughts about food by 60%, reduce the desire for late-night snacking by half, and make you so full that you automatically eat 441 fewer calories per day — just by adding protein to your diet . When it comes to losing weight, protein is the king of nutrients. Period. Low-Carb Vegetables Broccoli Cauliflower Spinach Tomatoes Kale Brussels sprouts Cabbage Swiss chard Lettuce Cucumber Full list here. Don’t be afraid to load your plate with these low-carb vegetables. You can eat massive amounts of them without going over 20–50 net carbs per day. A diet based mostly on meat and vegetables contains all the fiber, vitamins and minerals you need to be healthy. Fat Sources Olive oil Coconut oil Avocado oil Butter Eat 2–3 meals per day. If you find yourself hungry in the afternoon, add a 4th meal. Don’t be afraid of eating fat, as trying to do both low-carb AND low-fat at the same time is a recipe for failure. It will make you feel miserable and abandon the plan. To see how you can assemble your meals, check out this low-carb meal plan and this list of 101 healthy low-carb recipes. SUMMARYAssemble each meal out of a protein source, a fat source and low-carb vegetables. This will put you in the 20–50 gram carb range and significantly lower your hunger levels. 3. Lift Weights 3 Times Per Week You don't need to exercise to lose weight on this plan, but it is recommended. The best option is to go to the gym 3–4 times a week. Do a warm-up and lift some weights. If you're new to the gym, ask a trainer for some advice. By lifting weights, you will burn lots of calories and prevent your metabolism from slowing down, which is a common side effect of losing weight. Studies on low-carb diets show that you can even gain a bit of muscle while losing significant amounts of body fat . If lifting weights is not an option for you, then doing some cardio workouts like walking, jogging, running, cycling or swimming will suffice. SUMMARYIt is best to do some sort of resistance training like weight lifting. If that is not an option, cardio workouts are also effective. Optional — Do a \"Carb Refeed\" Once Per Week You can take one day off per week where you eat more carbs. Many people prefer Saturday. It is important to stick to healthy carb sources like oats, rice, quinoa, potatoes, sweet potatoes, fruit, etc. But only this one higher carb day — if you start doing it more often than once per week you're not going to see much success on this plan. If you must have a cheat meal and eat something unhealthy, then do it on this day. Be aware that cheat meals or carb refeeds are NOT necessary, but they can boost some fat-burning hormones like leptin and thyroid hormones. You will gain some weight during your refeed day, but most of it will be water weight and you will lose it again in the next 1–2 days. SUMMARYHaving one day each week where you eat more carbs is perfectly acceptable, although not necessary. What About Calories and Portion Control? It is NOT necessary to count calories as long as you keep the carbs very low and stick to protein, fat and low-carb vegetables. However, if you really want to count them, use this calculator. Enter your details, and then pick the number from either the \"Lose Weight\" or the \"Lose Weight Fast\" section — depending on how fast you want to lose weight. There are many great tools you can use to track the number of calories you are eating. Here is a list of 5 calorie counters that are free and easy to use. The main goal of this plan is to keep carbs under 20–50 grams per day and get the rest of your calories from protein and fat. SUMMARYIt is not necessary to count calories to lose weight on this plan. It is most important to strictly keep your carbs in the 20–50 gram range.","html":"<p>There are many ways to lose a lot of weight fast.</p><p>However, most of them will make you hungry and unsatisfied.</p><p>If you don&#39;t have iron willpower, then hunger will cause you to give up on these plans quickly.</p><p>The plan outlined here will:</p><ul><li>Reduce your appetite significantly.</li><li>Make you lose weight quickly, without hunger.</li><li>Improve your metabolic health at the same time.</li></ul><p>Here is a simple 3-step plan to lose weight fast.</p><h2>1. Cut Back on Sugars and Starches</h2><p>The most important part is to cut back on sugars and starches (carbs).</p><p>When you do that, your hunger levels go down and you end up eating much fewer calories.</p><p>Now instead of burning carbs for energy, your body starts feeding off of stored fat.</p><p>Another benefit of cutting carbs is that it lowers insulin levels, causing your kidneys to shed excess sodium and water out of your body. This reduces bloat and unnecessary water weight .</p><p>It is not uncommon to lose <strong>up to 10 pounds</strong> (sometimes more) in the first week of eating this way, both body fat and water weight.</p><p>This is a graph from a study comparing low-carb and low-fat diets in overweight or obese women .</p><p>Share on Pinterest</p><p>The low-carb group is eating until fullness, while the low-fat group is <strong>calorie-restricted and hungry.</strong></p><p>Cut the carbs and you will start to eat fewer calories automatically and without hunger.</p><p>Put simply, cutting carbs puts fat loss on autopilot.</p><p><strong>SUMMARY</strong>Removing sugars and starches (carbs) from your diet will reduce your appetite, lower your insulin levels and make you lose weight without hunger.</p><h2>2. Eat Protein, Fat and Vegetables</h2><p>Each one of your meals should include a protein source, a fat source and low-carb vegetables.</p><p>Constructing your meals in this way will automatically bring your carb intake into the recommended range of 20–50 grams per day.</p><h3>Protein Sources</h3><ul><li><strong>Meat:</strong> Beef, chicken, pork, lamb, etc.</li><li><strong>Fish and Seafood:</strong> Salmon, trout, shrimp, etc.</li><li><strong>Eggs:</strong> Whole eggs with the yolk are best.</li></ul><p>The importance of eating plenty of protein cannot be overstated.</p><p>This has been shown to boost metabolism by 80 to 100 calories per day.</p><p>High-protein diets can also reduce cravings and obsessive thoughts about food by 60%, reduce the desire for late-night snacking by half, and make you so full that you automatically eat 441 fewer calories per day — just by <strong>adding</strong> protein to your diet .</p><p>When it comes to losing weight, protein is the king of nutrients. Period.</p><h3>Low-Carb Vegetables</h3><ul><li>Broccoli</li><li>Cauliflower</li><li>Spinach</li><li>Tomatoes</li><li>Kale</li><li>Brussels sprouts</li><li>Cabbage</li><li>Swiss chard</li><li>Lettuce</li><li>Cucumber</li><li>Full list here.</li></ul><p>Don’t be afraid to load your plate with these low-carb vegetables. You can eat massive amounts of them without going over 20–50 net carbs per day.</p><p>A diet based mostly on meat and vegetables contains all the fiber, vitamins and minerals you need to be healthy.</p><h3>Fat Sources</h3><ul><li>Olive oil</li><li>Coconut oil</li><li>Avocado oil</li><li>Butter</li></ul><p>Eat 2–3 meals per day. If you find yourself hungry in the afternoon, add a 4th meal.</p><p>Don’t be afraid of eating fat, as trying to do both low-carb AND low-fat at the same time is a recipe for failure. It will make you feel miserable and abandon the plan.</p><p>To see how you can assemble your meals, check out this low-carb meal plan and this list of 101 healthy low-carb recipes.</p><p><strong>SUMMARY</strong>Assemble each meal out of a protein source, a fat source and low-carb vegetables. This will put you in the 20–50 gram carb range and significantly lower your hunger levels.</p><h2>3. Lift Weights 3 Times Per Week</h2><p>You don&#39;t <em>need</em> to exercise to lose weight on this plan, but it is recommended.</p><p>The best option is to go to the gym 3–4 times a week. Do a warm-up and lift some weights.</p><p>If you&#39;re new to the gym, ask a trainer for some advice.</p><p>By lifting weights, you will burn lots of calories and prevent your metabolism from slowing down, which is a common side effect of losing weight.</p><p>Studies on low-carb diets show that you can even gain a bit of muscle while losing significant amounts of body fat .</p><p>If lifting weights is not an option for you, then doing some cardio workouts like walking, jogging, running, cycling or swimming will suffice.</p><p><strong>SUMMARY</strong>It is best to do some sort of resistance training like weight lifting. If that is not an option, cardio workouts are also effective.</p><h2>Optional — Do a &quot;Carb Refeed&quot; Once Per Week</h2><p>You can take one day off per week where you eat more carbs. Many people prefer Saturday.</p><p>It is important to stick to healthy carb sources like oats, rice, quinoa, potatoes, sweet potatoes, fruit, etc.</p><p>But only this one higher carb day — if you start doing it more often than once per week you&#39;re not going to see much success on this plan.</p><p>If you must have a cheat meal and eat something unhealthy, then do it on this day.</p><p>Be aware that cheat meals or carb refeeds are NOT necessary, but they can boost some fat-burning hormones like leptin and thyroid hormones.</p><p>You will gain some weight during your refeed day, but most of it will be water weight and you will lose it again in the next 1–2 days.</p><p><strong>SUMMARY</strong>Having one day each week where you eat more carbs is perfectly acceptable, although not necessary.</p><h2>What About Calories and Portion Control?</h2><p>It is NOT necessary to count calories as long as you keep the carbs very low and stick to protein, fat and low-carb vegetables.</p><p>However, if you really want to count them, use this calculator.</p><p>Enter your details, and then pick the number from either the &quot;Lose Weight&quot; or the &quot;Lose Weight Fast&quot; section — depending on how fast you want to lose weight.</p><p>There are many great tools you can use to track the number of calories you are eating. Here is a list of 5 calorie counters that are free and easy to use.</p><p>The main goal of this plan is to keep carbs under 20–50 grams per day and get the rest of your calories from protein and fat.</p><p><strong>SUMMARY</strong>It is not necessary to count calories to lose weight on this plan. It is most important to strictly keep your carbs in the 20–50 gram range.</p>"}}}},{"node":{"id":"Prismic__Blogpost__W9zJ3RAAACcAYYBa","data":{"id":1,"title":{"text":"12 tips to help you lose weight on the 12-week plan","html":"<h1>12 tips to help you lose weight on the 12-week plan</h1>"},"image":{"alt":"","copyright":"","url":"https://blog-template.cdn.prismic.io/blog-template/e1f9fcb206fb81f26c09fac8e5fed5b036ac2165_diet.jpg"},"description":{"text":"Get off to the best possible start on the NHS 12-week weight loss plan with these 12 diet and exercise tips. 1. Don't skip breakfast Skipping breakfast won't help you lose weight. You could miss out on essential nutrients and you may end up snacking more throughout the day because you feel hungry. Check out five healthy breakfasts. 2. Eat regular meals Eating at regular times during the day helps burn calories at a faster rate. It also reduces the temptation to snack on foods high in fat and sugar. Find out more about eating heathily. 3. Eat plenty of fruit and veg Fruit and veg are low in calories and fat, and high in fibre – 3 essential ingredients for successful weight loss. They also contain plenty of vitamins and minerals. Read up on getting your 5 A Day. 4. Get more active Being active is key to losing weight and keeping it off. As well as providing numerous health benefits, exercise can help burn off the excess calories you can't cut through diet alone. Find an activity you enjoy and are able to fit into your routine. 5. Drink plenty of water People sometimes confuse thirst with hunger. You can end up consuming extra calories when a glass of water is really what you need. 6. Eat high-fibre foods Foods containing lots of fibre can help keep you to feel full, which is perfect for losing weight. Fibre is only found in food from plants, such as fruit and veg, oats, wholegrain bread, brown rice and pasta, and beans, peas and lentils. 7. Read food labels Knowing how to read food labels can help you choose healthier options. Use the calorie information to work out how a particular food fits into your daily calorie allowance on the weight loss plan. Find out more about reading food labels. 8. Use a smaller plate Using smaller plates can help you eat smaller portions. By using smaller plates and bowls, you may be able to gradually get used to eating smaller portions without going hungry. It takes about 20 minutes for the stomach to tell the brain it's full, so eat slowly and stop eating before you feel full. 9. Don't ban foods Don't ban any foods from your weight loss plan, especially the ones you like. Banning foods will only make you crave them more. There's no reason you can't enjoy the occasional treat as long as you stay within your daily calorie allowance. 10. Don't stock junk food To avoid temptation, try to not stock junk food – such as chocolate, biscuits, crisps and sweet fizzy drinks – at home. Instead, opt for healthy snacks, such as fruit, unsalted rice cakes, oat cakes, unsalted or unsweetened popcorn, and fruit juice. 11. Cut down on alcohol A standard glass of wine can contain as many calories as a piece of chocolate. Over time, drinking too much can easily contribute to weight gain. Find out more about the calories in alcohol. 12. Plan your meals Try to plan your breakfast, lunch, dinner and snacks for the week, making sure you stick to your calorie allowance. You may find it helpful to make a weekly shopping list.","html":"<p><strong>Get off to the best possible start on the NHS 12-week weight loss plan with these 12 diet and exercise tips.</strong></p><h2>1. Don&#39;t skip breakfast</h2><p>Skipping breakfast won&#39;t help you lose weight. You could miss out on essential nutrients and you may end up snacking more throughout the day because you feel hungry. Check out five healthy breakfasts.</p><h2>2. Eat regular meals</h2><p>Eating at regular times during the day helps burn calories at a faster rate. It also reduces the temptation to snack on foods high in fat and sugar. Find out more about eating heathily.</p><h2>3. Eat plenty of fruit and veg</h2><p>Fruit and veg are low in calories and fat, and high in fibre – 3 essential ingredients for successful weight loss. They also contain plenty of vitamins and minerals. Read up on getting your 5 A Day.</p><h2>4. Get more active</h2><p>Being active is key to losing weight and keeping it off. As well as providing numerous health benefits, exercise can help burn off the excess calories you can&#39;t cut through diet alone. Find an activity you enjoy and are able to fit into your routine.</p><h2>5. Drink plenty of water</h2><p>People sometimes confuse thirst with hunger. You can end up consuming extra calories when a glass of water is really what you need.</p><h2>6. Eat high-fibre foods</h2><p>Foods containing lots of fibre can help keep you to feel full, which is perfect for losing weight. Fibre is only found in food from plants, such as fruit and veg, oats, wholegrain bread, brown rice and pasta, and beans, peas and lentils.</p><h2>7. Read food labels</h2><p>Knowing how to read food labels can help you choose healthier options. Use the calorie information to work out how a particular food fits into your daily calorie allowance on the weight loss plan. Find out more about reading food labels.</p><h2>8. Use a smaller plate</h2><p>Using smaller plates can help you eat smaller portions. By using smaller plates and bowls, you may be able to gradually get used to eating smaller portions without going hungry. It takes about 20 minutes for the stomach to tell the brain it&#39;s full, so eat slowly and stop eating before you feel full.</p><h2>9. Don&#39;t ban foods</h2><p>Don&#39;t ban any foods from your weight loss plan, especially the ones you like. Banning foods will only make you crave them more. There&#39;s no reason you can&#39;t enjoy the occasional treat as long as you stay within your daily calorie allowance.</p><h2>10. Don&#39;t stock junk food</h2><p>To avoid temptation, try to not stock junk food – such as chocolate, biscuits, crisps and sweet fizzy drinks – at home. Instead, opt for healthy snacks, such as fruit, unsalted rice cakes, oat cakes, unsalted or unsweetened popcorn, and fruit juice.</p><h2>11. Cut down on alcohol</h2><p>A standard glass of wine can contain as many calories as a piece of chocolate. Over time, drinking too much can easily contribute to weight gain. Find out more about the calories in alcohol.</p><h2>12. Plan your meals</h2><p>Try to plan your breakfast, lunch, dinner and snacks for the week, making sure you stick to your calorie allowance. You may find it helpful to make a weekly shopping list.</p>"}}}}]}},"pageContext":{"id":0}}