{"data":{"allPrismicBlogpost":{"edges":[{"node":{"id":"Prismic__Blogpost__W9020REAACQAI-KE","data":{"id":5,"title":{"text":"14 Reasons You Can't Lose Weight","html":"<h1>14 Reasons You Can&#39;t Lose Weight</h1>"},"image":{"alt":"","copyright":"","url":"https://blog-template.cdn.prismic.io/blog-template/ccc7d07bb4e032b8b2056612d9ccad37c8da9f2d_maxresdefault.jpg"},"description":{"text":"Are you eating well and exercising, but your weight just won't budge? Or it's going up? Desperate attempts to lose weight can be so frustrating and create a real stress in our lives. In fact, I'll go as far as saying that weight is the NUMBER ONE stress for women I know. It's a vicious cycle of trying to control what we eat, feeling like a failure because the scale doesn't move, punishing ourselves for not being \"more in control,\" and then manifesting a huge amount of bodily stress that causes further havoc in our bodies. Then we binge or take our diet to an extreme (never healthy) and the cycle continues… Oh gosh I’ve exhausted myself just typing that! Our self-esteem is measured by what the scales say, right? Of course not, but that’s what I believed. Now I believe that when we are kinder to ourselves, and practice positive thinking, our body will start to work in our favor. And the weight will go down. Of course it’s not thaat simple, but it's the first part of being more in control of your own body weight. And it doesn't need to be such a stress! There is a way to live without worrying about your weight and watching everything that enters your mouth. Once we have the skills in place to find happiness and psychological wellbeing, healthy eating habits (and a healthy weight) will follow easily. Here are 14 reasons you may be hitting the wall with your weight… 1. Your hormones aren't balanced. If you are fatigued, suffer from PMS, experience irregular menstrual cycles, find it hard to lose weight, feel depressed or anxious, you may have a hormonal imbalance. Best to see a nutritionist or doctor who can support you and suggest certain tests that will confirm this so you can take appropriate action. 2. You're not getting enough Vitamin D. A huge number of the population have low Vitamin D, which is associated with weight gain and several metabolic processes. If you spend much of your life indoors, get your Vitamin D checked with your doctor. 3. You're exercising, but not in a way that’s benefiting your body! You are either exercising too much or you need to mix it up a bit and give the body a bit of a shock. (Funnily enough, most people I see who over exercise tend to put on weight easily.) Enjoy a variety of workout techniques: weight training, Pilates, yoga and interval training. Quick and hard bursts are good. And weight training is very helpful to raise your metabolism. 4. Your digestion and absorption is not optimal. You are not what you eat; you are what you digest and absorb! Our gut health will determine our overall wellbeing. The bacteria that lies in our gut helps us to fight disease, process our food, make nutrients and make hormones etc. 5. You're sitting on your ass all day. You're not moving your body enough throughout the day, and your body does not like this. I understand some of your have office jobs and are tied to your desk, but is it possible to go for a few minute stroll every hour? Or walk 20 minutes to grab lunch? 6. You're eating too much. I'd love to be able to say you can eat as much healthy food as you like, but unfortunately this is just not the case. The body cannot cope with a lot of food at once. It's vital to put good portions on your plate. (I usually say: ¼ of the plate should be protein, ¼ carbohydrate and ½ veggies.) Fill that plate with your greens, my love, and eat 5 to 6 small meals a day. We must learn to listen to our bodies when it's full and to stop eating! We all need to work on this. 7. You're not chewing your food. Chewing your food until it's liquid will really help with weight loss and better digestive performance. 8. You're stressed and not finding balance in your days. Stress can impact your weight in a number of ways. Long term stress = high cortisol, which is linked to blood sugar imbalance and weight gain around the mid-section. 9. You're not sleeping enough. Sleep = repair. When your body gets enough rest, it's able to perform. 10. You're a fad dieter. This is not way of life. I often ask people are you weight conscious or health conscious? They're very different mentalities that foster very different choices. 11. You're eating out too much and not cooking at home. Trust me, you just don’t know what that restaurant is using to cook your food. Assume they're using the worst vegetable oils, heavy amounts of butter and oil, and poor-quality produce. Unless you're dining at a place that claims healthy cooking and uses healthy produce, learn to love your kitchen! 12, You're not adding protein to your plate. Protein is the satiety macronutrient that helps us to balance out blood sugars and therefore helps to control our weight 13. You're scared of good fats. Don't be! Good fats are so so important to your brain and for making hormones. (So you can imagine why many of those who suffer from hormonal imbalances usually eat a low-fat diet) and your heart. The body actually uses the good fats and they will help to lower your LDL cholesterol. 14. Your liver is sluggish and you need a good cleanse! If you're feeling low, tired, and moody and your diet contains alcohol, coffee and sugar, you need to give your body a break. When your liver is sluggish, it struggles to process substances/toxins/hormones efficiently and this leads to toxic build up and this will inevitably cause weight gain. You might benefit from a seasonal cleanse.","html":"<p>Are you eating well and exercising, but your weight just won&#39;t budge? Or it&#39;s going up? Desperate attempts to lose weight can be so frustrating and create a real stress in our lives. In fact, I&#39;ll go as far as saying that weight is the NUMBER ONE stress for women I know.</p><p>It&#39;s a vicious cycle of trying to control what we eat, feeling like a failure because the scale doesn&#39;t move, punishing ourselves for not being &quot;more in control,&quot; and then manifesting a huge amount of bodily stress that causes further havoc in our bodies. Then we binge or take our diet to an extreme (never healthy) and the cycle continues…</p><p>Oh gosh I’ve exhausted myself just typing that!</p><p>Our self-esteem is measured by what the scales say, right?</p><p>Of course not, but that’s what I believed. Now I believe that when we are kinder to ourselves, and practice positive thinking, our body will start to work in our favor. And the weight will go down.</p><p>Of course it’s not <em>thaat</em> simple, but it&#39;s the first part of being more in control of your own body weight.</p><p>And it doesn&#39;t need to be such a stress! There <em>is</em> a way to live without worrying about your weight and watching everything that enters your mouth. Once we have the skills in place to find happiness and psychological wellbeing, healthy eating habits (and a healthy weight) will follow easily.</p><p><strong>Here are 14 reasons you may be hitting the wall with your weight…</strong></p><p><strong>1. Your hormones aren&#39;t balanced.</strong></p><p>If you are fatigued, suffer from PMS, experience irregular menstrual cycles, find it hard to lose weight, feel depressed or anxious, you may have a hormonal imbalance. Best to see a nutritionist or doctor who can support you and suggest certain tests that will confirm this so you can take appropriate action.</p><p><strong>2. You&#39;re not getting enough Vitamin D.</strong></p><p>A huge number of the population have low Vitamin D, which is associated with weight gain and several metabolic processes. If you spend much of your life indoors, get your Vitamin D checked with your doctor.</p><p><strong>3. You&#39;re exercising, but not in a way that’s benefiting your body!</strong></p><p>You are either exercising too much or you need to mix it up a bit and give the body a bit of a shock. (Funnily enough, most people I see who over exercise tend to put on weight easily.) Enjoy a variety of workout techniques: weight training, Pilates, yoga and interval training. Quick and hard bursts are good. And weight training is very helpful to raise your metabolism.</p><p><strong>4. Your digestion and absorption is not optimal.</strong></p><p>You are not what you eat; you are what you digest and absorb! Our gut health will determine our overall wellbeing. The bacteria that lies in our gut helps us to fight disease, process our food, make nutrients and make hormones etc.</p><p><strong>5. You&#39;re sitting on your ass all day.</strong></p><p>You&#39;re not moving your body enough throughout the day, and your body does not like this. I understand some of your have office jobs and are tied to your desk, but is it possible to go for a few minute stroll every hour? Or walk 20 minutes to grab lunch?</p><p><strong>6. You&#39;re eating too much.</strong></p><p>I&#39;d love to be able to say you can eat as much healthy food as you like, but unfortunately this is just not the case. The body cannot cope with a lot of food at once. It&#39;s vital to put good portions on your plate. (I usually say: ¼ of the plate should be protein, ¼ carbohydrate and ½ veggies.) Fill that plate with your greens, my love, and eat 5 to 6 small meals a day. We must learn to listen to our bodies when it&#39;s full and to stop eating! We all need to work on this.</p><p><strong>7. You&#39;re not chewing your food.</strong></p><p>Chewing your food until it&#39;s liquid will really help with weight loss and better digestive performance.</p><p><strong>8. You&#39;re stressed and not finding balance in your days.</strong></p><p>Stress can impact your weight in a number of ways. Long term stress = high cortisol, which is linked to blood sugar imbalance and weight gain around the mid-section.</p><p><strong>9. You&#39;re not sleeping enough.</strong></p><p>Sleep = repair. When your body gets enough rest, it&#39;s able to perform.</p><p><strong>10. You&#39;re a fad dieter.</strong></p><p>This is not way of life. I often ask people are you <em>weight conscious</em> or <em>health conscious</em>? They&#39;re very different mentalities that foster very different choices.</p><p><strong>11. You&#39;re eating out too much and not cooking at home.</strong></p><p>Trust me, you just don’t know what that restaurant is using to cook your food. Assume they&#39;re using the worst vegetable oils, heavy amounts of butter and oil, and poor-quality produce. Unless you&#39;re dining at a place that claims healthy cooking and uses healthy produce, learn to love your kitchen!</p><p><strong>12, You&#39;re not adding protein to your plate.</strong></p><p>Protein is the satiety macronutrient that helps us to balance out blood sugars and therefore helps to control our weight</p><p><strong>13. You&#39;re scared of good fats.</strong></p><p>Don&#39;t be! Good fats are so so important to your brain and for making hormones. (So you can imagine why many of those who suffer from hormonal imbalances usually eat a low-fat diet) and your heart. The body actually uses the good fats and they will help to lower your LDL cholesterol.</p><p><strong>14. Your liver is sluggish and you need a good cleanse!</strong></p><p>If you&#39;re feeling low, tired, and moody and your diet contains alcohol, coffee and sugar, you need to give your body a break. When your liver is sluggish, it struggles to process substances/toxins/hormones efficiently and this leads to toxic build up and this will inevitably cause weight gain. You might benefit from a seasonal cleanse.</p>"}}}}]}},"pageContext":{"productId":5}}