{"data":{"allPrismicBlogpost":{"edges":[{"node":{"id":"Prismic__Blogpost__W901fBEAACcAI9yb","data":{"id":2,"title":{"text":"10 Ways to Lose Weight Without Dieting","html":"<h1>10 Ways to Lose Weight Without Dieting</h1>"},"image":{"alt":"","copyright":"","url":"https://blog-template.cdn.prismic.io/blog-template/336a5e44125e7aa42790eaeb9648a66fed14f903_lose-weight-without-dieting-654.jpg"},"description":{"text":"One pound of fat -- is equal to 3,500 calories. By shaving 500 calories a day through dietary and exercise modifications, you can lose about a pound a week. If you only need to maintain your current weight, shaving 100 calories a day is enough to avoid the extra 1-2 pounds most adults gain each year. Adopt one or more of these simple, painless strategies to help lose weight without going on a \"diet\": Eat Breakfast Every Day. One habit that's common to many people who have lost weight and kept it off is eating breakfast every day. \"Many people think skipping breakfast is a great way to cut calories, but they usually end up eating more throughout the day, says Elizabeth Ward, MS, RD, author of The Pocket Idiot's Guide to the New Food Pyramids. \"Studies show people who eat breakfast have lower BMIs than breakfast-skippers and perform better, whether at school or in the boardroom.\" Try a bowl of whole-grain cereal topped with fruit and low-fat dairy for a quick and nutritious start to your day. Close the Kitchen at Night. Establish a time when you will stop eating so you won't give in to the late-night munchies or mindless snacking while watching television. \"Have a cup of tea, suck on a piece of hard candy or enjoy a small bowl of light ice cream or frozen yogurt if you want something sweet after dinner, but then brush your teeth so you will be less likely to eat or drink anything else,\" suggests Elaine Magee, MPH, RD, WebMD's \"Recipe Doctor\" and the author of Comfort FoodMakeovers. Choose Liquid Calories Wisely. Sweetened drinks pile on the calories, but don't reduce hunger like solid foods do. Satisfy your thirst with water, sparkling water with citrus, skim or low-fat milk, or small portions of 100% fruit juice. Try a glass of nutritious and low-calorie vegetable juice to hold you over if you get hungry between meals. Be careful of alcohol calories, which add up quickly. If you tend to drink a glass or two of wine or a cocktail on most days, limiting alcohol to the weekends can be a huge calorie saver. Eat More Produce. Eating lots of low-calorie, high-volume fruits and vegetables crowds out other foods that are higher in fat and calories. Move the meat off the center of your plate and pile on the vegetables. Or try starting lunch or dinner with a vegetable salad or bowl of broth-based soup, suggests Barbara Rolls, PhD, author of The VolumetricsEating Plan. The U.S. government's 2005 Dietary Guidelines suggest that adults get 7-13 cups of produce daily. Ward says that's not really so difficult: \"Stock your kitchen with plenty of fruits and vegetables and at every meal and snack, include a few servings,\" she says. \"Your diet will be enriched with vitamins, minerals, phytonutrients, fiber, and if you fill up on super-nutritious produce, you won't be reaching for the cookie jar.\" Go for the Grain. By substituting whole grains for refined grains like white bread, cakes, cookies, and pretzels, you add much-needed fiber and will fill up faster so you're more likely to eat a reasonable portion. Choose whole-wheat breads and pastas, brown rice, bran flakes, popcorn, and whole-rye crackers. Control Your Environments. Another simple strategy to help cut calories is to control your environment -- everything from stocking your kitchen with lots of healthy options to choosing the right restaurants. That means avoiding the temptation by staying away from all-you-can-eat restaurants. And when it comes to parties, \"eat a healthy snack before so you won't be starving, and be selective when you fill your plate at the buffet,\" suggests Ward. Before going back for more food, wait at least 15 minutes and have a big glass of water. Trim Portions. If you did nothing else but reduce your portions by 10%-20%, you would lose weight. Most of the portions served both in restaurants and at home are bigger than you need. Pull out the measuring cups to get a handle on your usual portion sizes, and work on paring them down. Get instant portion control by using small bowls, plates, and cups, says Brian Wansink, PhD, author of Mindless Eating. You won't feel deprived because the food will look plentiful on dainty dishware. Add More Steps. Get yourself a pedometer and gradually add more steps until you reach 10,000 per day. Throughout the day, do whatever you can to be more active -- pace while you talk on the phone, take the dog out for an extra walk, and march in place during television commercials. Having a pedometer serves as a constant motivator and reminder. Have Protein at Every Meal and Snack. Adding a source of lean or low-fat protein to each meal and snack will help keep you feeling full longer so you're less likely to overeat. Try low-fat yogurt, small portion of nuts, peanut butter, eggs, beans, or lean meats. Experts also recommend eating small, frequent meals and snacks (every 3-4 hours), to keep your blood sugar levels steady and to avoid overindulging. Switch to Lighter Alternatives. Whenever you can, use the low-fat versions of salad dressings, mayonnaise, dairy products, and other products. \"You can trim calories effortlessly if you use low-fat and lighter products, and if the product is mixed in with other ingredients, no one will ever notice,\" says Magee. More smart substitutions: Use salsa or hummus as a dip; spread sandwiches with mustard instead of mayo; eat plain roasted sweet potatoes instead of loaded white potatoes; use skim milk instead of cream in your coffee; hold the cheese on sandwiches; and use a little vinaigrette on your salad instead of piling on the creamy dressing.","html":"<p>One pound of fat -- is equal to 3,500 calories. By shaving 500 calories a day through dietary and exercise modifications, you can lose about a pound a week. If you only need to maintain your current weight, shaving 100 calories a day is enough to avoid the extra 1-2 pounds most adults gain each year.</p><p>Adopt one or more of these simple, painless strategies to help lose weight without going on a &quot;diet&quot;:</p><ol><li><strong>Eat Breakfast Every Day.</strong> One habit that&#39;s common to many people who have lost weight and kept it off is eating breakfast every day. &quot;Many people think skipping breakfast is a great way to cut calories, but they usually end up eating more throughout the day, says Elizabeth Ward, MS, RD, author of <em>The Pocket Idiot&#39;s Guide to the New Food Pyramids</em>. &quot;Studies show people who eat breakfast have lower BMIs than breakfast-skippers and perform better, whether at school or in the boardroom.&quot; Try a bowl of whole-grain cereal topped with fruit and low-fat dairy for a quick and nutritious start to your day.</li><li><strong>Close the Kitchen at Night.</strong> Establish a time when you will stop eating so you won&#39;t give in to the late-night munchies or mindless snacking while watching television. &quot;Have a cup of tea, suck on a piece of hard candy or enjoy a small bowl of light ice cream or frozen yogurt if you want something sweet after dinner, but then brush your teeth so you will be less likely to eat or drink anything else,&quot; suggests Elaine Magee, MPH, RD, WebMD&#39;s &quot;Recipe Doctor&quot; and the author of <em>Comfort FoodMakeovers</em>.</li><li><strong>Choose Liquid Calories Wisely.</strong> Sweetened drinks pile on the calories, but don&#39;t reduce hunger like solid foods do. Satisfy your thirst with water, sparkling water with citrus, skim or low-fat milk, or small portions of 100% fruit juice. Try a glass of nutritious and low-calorie vegetable juice to hold you over if you get hungry between meals. Be careful of alcohol calories, which add up quickly. If you tend to drink a glass or two of wine or a cocktail on most days, limiting alcohol to the weekends can be a huge calorie saver.</li><li><strong>Eat More Produce.</strong> Eating lots of low-calorie, high-volume fruits and vegetables crowds out other foods that are higher in fat and calories. Move the meat off the center of your plate and pile on the vegetables. Or try starting lunch or dinner with a vegetable salad or bowl of broth-based soup, suggests Barbara Rolls, PhD, author of <em>The VolumetricsEating Plan</em>. The U.S. government&#39;s 2005 Dietary Guidelines suggest that adults get 7-13 cups of produce daily. Ward says that&#39;s not really so difficult: &quot;Stock your kitchen with plenty of fruits and vegetables and at every meal and snack, include a few servings,&quot; she says. &quot;Your diet will be enriched with vitamins, minerals, phytonutrients, fiber, and if you fill up on super-nutritious produce, you won&#39;t be reaching for the cookie jar.&quot;</li><li><strong>Go for the Grain. </strong>By substituting whole grains for refined grains like white bread, cakes, cookies, and pretzels, you add much-needed fiber and will fill up faster so you&#39;re more likely to eat a reasonable portion. Choose whole-wheat breads and pastas, brown rice, bran flakes, popcorn, and whole-rye crackers.</li><li><strong>Control Your Environments.</strong> Another simple strategy to help cut calories is to control your environment -- everything from stocking your kitchen with lots of healthy options to choosing the right restaurants. That means avoiding the temptation by staying away from all-you-can-eat restaurants. And when it comes to parties, &quot;eat a healthy snack before so you won&#39;t be starving, and be selective when you fill your plate at the buffet,&quot; suggests Ward. Before going back for more food, wait at least 15 minutes and have a big glass of water.</li><li><strong>Trim Portions.</strong> If you did nothing else but reduce your portions by 10%-20%, you would lose weight. Most of the portions served both in restaurants and at home are bigger than you need. Pull out the measuring cups to get a handle on your usual portion sizes, and work on paring them down. Get instant portion control by using small bowls, plates, and cups, says Brian Wansink, PhD, author of <em>Mindless Eating.</em> You won&#39;t feel deprived because the food will look plentiful on dainty dishware.</li><li><strong>Add More Steps.</strong> Get yourself a pedometer and gradually add more steps until you reach 10,000 per day. Throughout the day, do whatever you can to be more active -- pace while you talk on the phone, take the dog out for an extra walk, and march in place during television commercials. Having a pedometer serves as a constant motivator and reminder.</li><li><strong>Have Protein at Every Meal and Snack. </strong>Adding a source of lean or low-fat protein to each meal and snack will help keep you feeling full longer so you&#39;re less likely to overeat. Try low-fat yogurt, small portion of nuts, peanut butter, eggs, beans, or lean meats. Experts also recommend eating small, frequent meals and snacks (every 3-4 hours), to keep your blood sugar levels steady and to avoid overindulging.</li><li><strong>Switch to Lighter Alternatives.</strong> Whenever you can, use the low-fat versions of salad dressings, mayonnaise, dairy products, and other products. &quot;You can trim calories effortlessly if you use low-fat and lighter products, and if the product is mixed in with other ingredients, no one will ever notice,&quot; says Magee. More smart substitutions: Use salsa or hummus as a dip; spread sandwiches with mustard instead of mayo; eat plain roasted sweet potatoes instead of loaded white potatoes; use skim milk instead of cream in your coffee; hold the cheese on sandwiches; and use a little vinaigrette on your salad instead of piling on the creamy dressing.</li></ol>"}}}}]}},"pageContext":{"productId":2}}